load-test.yml
config:
  target: 'https://jomiastore.vercel.app'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 200
      name: "Peak load"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "Homepage Load Test"
    weight: 40
    flow:
      - get:
          url: "/"
          name: "Homepage"
      - think: 2
      - get:
          url: "/api/products"
          name: "Products API"
      - think: 1

  - name: "Search Test"
    weight: 30
    flow:
      - get:
          url: "/"
          name: "Homepage"
      - think: 1
      - get:
          url: "/api/products?search=smartphone"
          name: "Search Products"
      - think: 2

  - name: "Category Test"
    weight: 20
    flow:
      - get:
          url: "/category/electronique"
          name: "Electronics Category"
      - think: 1
      - get:
          url: "/api/products?category=electronique"
          name: "Category Products"
      - think: 2

  - name: "User Journey"
    weight: 10
    flow:
      - get:
          url: "/"
          name: "Homepage"
      - think: 1
      - get:
          url: "/api/products"
          name: "Products API"
      - think: 2
      - get:
          url: "/api/categories"
          name: "Categories API"
      - think: 1